Python 3.13.5 (tags/v3.13.5:6cb20a2, Jun 11 2025, 16:15:46) [MSC v.1943 64 bit (AMD64)] on win32
Enter "help" below or click "Help" above for more information.

========== RESTART: C:/Users/user/Desktop/10409김태균_1029_30.py ==========
학번 입력:10409
이름 입력:김태균
1학년 04반 09번, 성김 이름태균
1학년4반9번

========== RESTART: C:/Users/user/Desktop/10409김태균_1029_30.py ==========
학번 입력:10409
이름 입력:김태균
1학년 04반 09번, 성:김 이름:태균
1학년4반9번

========== RESTART: C:/Users/user/Desktop/10409김태균_1029_30.py ==========
학번 입력:10409
이름 입력:김태균
1학년 04반 09번, 성:김 이름:태균
1학년04반09번, 성김이름태균
1학년4반9번

========== RESTART: C:/Users/user/Desktop/10409김태균_1029_30.py ==========
학번 입력:10409
이름 입력:김태균
1학년 04반 09번, 성:김 이름:태균
1학년04반09번, 성:김이름:태균
1학년4반9번

========== RESTART: C:/Users/user/Desktop/10409김태균_1029_30.py ==========
학번 입력:10409
이름 입력:김태균
1학년 04반 09번, 성:김 이름:태균
1학년04반09번, 성:김 이름:태균
1학년4반9번

========== RESTART: C:/Users/user/Desktop/10409김태균_1029_30.py ==========
학번 입력:10409
이름 입력:김태균
1학년 04반 09번, 성:김 이름:태균
1학년04반09번, 성:김 이름:태균
1학년4반9번
1학년 4반 9번
>>> 
========== RESTART: C:/Users/user/Desktop/10409김태균_1029_30.py ==========
학번 입력:10409
이름 입력:김태균
1학년 04반 09번, 성:김 이름:태균
1학년04반09번, 성:김 이름:태균
1학년4반9번
1학년 4반 9번
1
>>> lst = list()
>>> lst
[]
>>> lst.append(90)
>>> lst
[90]
>>> lst.append(97)
>>> lst
[90, 97]
>>> lst.append(85)
>>> lst
[90, 97, 85]
>>> lst.sort()
>>> lst
[85, 90, 97]
>>> lst.reverse()
>>> lst
[97, 90, 85]
>>> lst.index(90)
1
>>> lst.count(90)
1
>>> lst.pop()
85
>>> lst
[97, 90]
