Python 3.13.5 (tags/v3.13.5:6cb20a2, Jun 11 2025, 16:15:46) [MSC v.1943 64 bit (AMD64)] on win32
Enter "help" below or click "Help" above for more information.

============== RESTART: C:/Users/user/Desktop/10512윤시원_1118_45.py ==============
반복 횟수 :10
값 입력:10
v:10,c:1,s:10
값 입력:10
v:10,c:2,s:20
값 입력:20
v:20,c:3,s:40
값 입력:30
v:30,c:4,s:70
값 입력:45
v:45,c:5,s:115
값 입력:60
v:60,c:6,s:175
값 입력:70
v:70,c:7,s:245
값 입력:80
v:80,c:8,s:325
값 입력:90
v:90,c:9,s:415
값 입력:
============== RESTART: C:/Users/user/Desktop/10512윤시원_1118_45.py ==============
반복 횟수 :3
값 입력:3
v:3,c:1,s:3
값 입력:10
v:10,c:2,s:13
값 입력:10
v:10,c:3,s:23
>>> 
>>> 
============== RESTART: C:/Users/user/Desktop/10512윤시원_1118_46.py ==============
수1 입력:12
수2 입력:12
>>> 12
12
>>> 12
12
>>> 
>>> 
>>> 
>>> 
>>> 
>>> student = {'학번':2025,'소속':'AI','이름':'김경복'}
>>> student ['이름']
'김경복'
>>> student
{'학번': 2025, '소속': 'AI', '이름': '김경복'}
>>> student['학년'] = 1
>>> student
{'학번': 2025, '소속': 'AI', '이름': '김경복', '학년': 1}
>>> student['학년'] = 2
>>> student
{'학번': 2025, '소속': 'AI', '이름': '김경복', '학년': 2}
>>> del student ['소속']
>>> student
{'학번': 2025, '이름': '김경복', '학년': 2}
>>> f"내 이름은 {student['이름']}, 학년은 {student['학년']}학년 입니다."
'내 이름은 김경복, 학년은 2학년 입니다.'
